How do occupational outcomes differ between male and female health graduates, and is there evidence of vertical segregation (e.g., men in senior roles)? 

Focus: Analyse whether male graduates disproportionately occupy managerial/senior positions despite being a minority in healthcare fields.

In [1]:
# Imports
import pandas as pd
import numpy as np

In [2]:
# Load in the CSV for graduate regions by gender 
file_path = 'csv_version/graduate_occupations_by_gender.csv'
df = pd.read_csv(file_path)
df.head()

,STATISTIC,Statistic Label,TLIST(A1),Graduation Year,C04477V05260,Field of Study,C03919V04671,Gender,C02843V04551,Occupations,UNIT,VALUE
0,HGO21C01,Number of Health Graduates,2010,2010,30,Nursing and Midwifery,10,Male,1,"Managers, directors and senior officials",Number,3.0
1,HGO21C01,Number of Health Graduates,2010,2010,30,Nursing and Midwifery,10,Male,3,Associate professional and technical occupations,Number,3.0
2,HGO21C01,Number of Health Graduates,2010,2010,30,Nursing and Midwifery,10,Male,4,Administrative and secretarial occupations,Number,NaN
3,HGO21C01,Number of Health Graduates,2010,2010,30,Nursing and Midwifery,10,Male,5,Skilled trades occupations,Number,NaN
4,HGO21C01,Number of Health Graduates,2010,2010,30,Nursing and Midwifery,10,Male,6,"Caring, leisure and other service occupations",Number,3.0

In [3]:
# Intial inspection of the data
print("shape of dataset", df.shape)
print("column names:")
print(df.columns.tolist())

shape of dataset (2808, 12)
column names:
['STATISTIC', 'Statistic Label', 'TLIST(A1)', 'Graduation Year', 'C04477V05260', 'Field of Study', 'C03919V04671', 'Gender', 'C02843V04551', 'Occupations', 'UNIT', 'VALUE']

In [4]:
# is there missing rows?
print(df.isna().sum())

STATISTIC             0
Statistic Label       0
TLIST(A1)             0
Graduation Year       0
C04477V05260          0
Field of Study        0
C03919V04671          0
Gender                0
C02843V04551          0
Occupations           0
UNIT                  0
VALUE              1556
dtype: int64

*Missing 1556 VALUE values*

In [5]:
print("Unique values per column:")
for col in df.columns:
    print(f"{col}: {df[col].nunique()} → {df[col].unique()[:10]}")

Unique values per column:
STATISTIC: 1 → ['HGO21C01']
Statistic Label: 1 → ['Number of Health Graduates']
TLIST(A1): 12 → [2010 2011 2012 2013 2014 2015 2016 2017 2018 2019]
Graduation Year: 12 → [2010 2011 2012 2013 2014 2015 2016 2017 2018 2019]
C04477V05260: 3 → [ 30 202 702]
Field of Study: 3 → ['Nursing and Midwifery' 'Medicine' 'Social Care']
C03919V04671: 3 → ['10' '20' '-']
Gender: 3 → ['Male' 'Female' 'All genders']
C02843V04551: 26 → ['1' '3' '4' '5' '6' '7' '8' '9' '21' '23']
Occupations: 26 → ['Managers, directors and senior officials'
 'Associate professional and technical occupations'
 'Administrative and secretarial occupations' 'Skilled trades occupations'
 'Caring, leisure and other service occupations'
 'Sales and customer service occupations'
 'Process, plant and machine operatives' 'Elementary occupations'
 'Science, research, engineering and technology professionals'
 'Teaching and educational professionals']
UNIT: 1 → ['Number']
VALUE: 158 → [  3.  nan   0.  45.  54.  24.   9.  12. 714. 786.]

| Column | Keep or drop |
|-----|-----|
|Statistic | drop |
|statistic label | drop |
|Tlist | drop |
|Graduation year | Keep |
|C04477V05260 | drop |
|Field of Study | Keep |
|C03919V04671 | drop |
|Gender | Keep |
|C02843V04551 | drop |
|Occupations | Keep |
|unit | drop |
|value | Keep |

In [7]:
# list of column i need to drop
cols_to_drop = [
    'STATISTIC',             # constant
    'Statistic Label',       # constant
    'TLIST(A1)',             # duplicate of Graduation Year
    'C04477V05260',          # code for Field of Study
    'C03919V04671',          # code for Gender
    'C02843V04551',          # code for Occupations
    'UNIT'                   # constant ("Number")
]

# create a new df without the droped columns
df_clean = df.drop(columns=cols_to_drop)


df_clean.head()

,Graduation Year,Field of Study,Gender,Occupations,VALUE
0,2010,Nursing and Midwifery,Male,"Managers, directors and senior officials",3.0
1,2010,Nursing and Midwifery,Male,Associate professional and technical occupations,3.0
2,2010,Nursing and Midwifery,Male,Administrative and secretarial occupations,NaN
3,2010,Nursing and Midwifery,Male,Skilled trades occupations,NaN
4,2010,Nursing and Midwifery,Male,"Caring, leisure and other service occupations",3.0

In [8]:
# filter missing rows 
nan_rows = df_clean[df_clean['VALUE'].isna()]

# show the first 10
nan_rows.head(10)

,Graduation Year,Field of Study,Gender,Occupations,VALUE
2,2010,Nursing and Midwifery,Male,Administrative and secretarial occupations,NaN
3,2010,Nursing and Midwifery,Male,Skilled trades occupations,NaN
5,2010,Nursing and Midwifery,Male,Sales and customer service occupations,NaN
6,2010,Nursing and Midwifery,Male,"Process, plant and machine operatives",NaN
7,2010,Nursing and Midwifery,Male,Elementary occupations,NaN
9,2010,Nursing and Midwifery,Male,Teaching and educational professionals,NaN
10,2010,Nursing and Midwifery,Male,"Business, media and public service professionals",NaN
12,2010,Nursing and Midwifery,Male,Psychologists,NaN
13,2010,Nursing and Midwifery,Male,Pharmacists,NaN
14,2010,Nursing and Midwifery,Male,Ophthalmic opticians,NaN

In [9]:
nan_rows.to_csv('RQ2NaN.csv')

RQ2 is not about "VALUE" so this may be able to be dropped entirely

In [10]:
unique_ocupations = df_clean['Occupations'].unique()
unique_ocupations

array(['Managers, directors and senior officials',
       'Associate professional and technical occupations',
       'Administrative and secretarial occupations',
       'Skilled trades occupations',
       'Caring, leisure and other service occupations',
       'Sales and customer service occupations',
       'Process, plant and machine operatives', 'Elementary occupations',
       'Science, research, engineering and technology professionals',
       'Teaching and educational professionals',
       'Business, media and public service professionals',
       'Medical practitioners', 'Psychologists', 'Pharmacists',
       'Ophthalmic opticians', 'Dental practitioners', 'Veterinarians',
       'Medical radiographers', 'Podiatrists',
       'Health professionals n.e.c.', 'Physiotherapists',
       'Occupational therapists', 'Speech and language therapists',
       'Therapy professionals n.e.c.', 'Nurses and midwives',
       'All occupational groups'], dtype=object)

In [11]:
unique_genders = df_clean['Gender'].unique()
unique_genders

array(['Male', 'Female', 'All genders'], dtype=object)

need to drop all genders rows as it is not required for the RQ

In [15]:
all_gender_count = df_clean[df_clean['Gender'] == 'All genders'].shape[0]
all_gender_count

936

In [16]:
df_clean_mf = df_clean[df_clean['Gender'] != 'All genders'].copy()

In [17]:
unique_genders_mf = df_clean_mf['Gender'].unique()
unique_genders_mf

array(['Male', 'Female'], dtype=object)

I have to drop the NaN VALUE rows from the table too

In [20]:
# filter missing rows 
nan_rows_mf = df_clean_mf[df_clean_mf['VALUE'].isna()]

# show the first 10
nan_rows_mf.head(10)

,Graduation Year,Field of Study,Gender,Occupations,VALUE
2,2010,Nursing and Midwifery,Male,Administrative and secretarial occupations,NaN
3,2010,Nursing and Midwifery,Male,Skilled trades occupations,NaN
5,2010,Nursing and Midwifery,Male,Sales and customer service occupations,NaN
6,2010,Nursing and Midwifery,Male,"Process, plant and machine operatives",NaN
7,2010,Nursing and Midwifery,Male,Elementary occupations,NaN
9,2010,Nursing and Midwifery,Male,Teaching and educational professionals,NaN
10,2010,Nursing and Midwifery,Male,"Business, media and public service professionals",NaN
12,2010,Nursing and Midwifery,Male,Psychologists,NaN
13,2010,Nursing and Midwifery,Male,Pharmacists,NaN
14,2010,Nursing and Midwifery,Male,Ophthalmic opticians,NaN

In [22]:
nan_rows_mf.describe()

       Graduation Year  VALUE
count      1118.000000    0.0
mean       2015.720036    NaN
std           3.484891    NaN
min        2010.000000    NaN
25%        2013.000000    NaN
50%        2016.000000    NaN
75%        2019.000000    NaN
max        2021.000000    NaN

In [23]:
df_clean_mf.describe()

       Graduation Year        VALUE
count      1872.000000   754.000000
mean       2015.500000    59.860743
std           3.452975   162.440944
min        2010.000000     0.000000
25%        2012.750000     0.000000
50%        2015.500000     3.000000
75%        2018.250000    24.000000
max        2021.000000  1116.000000

there will be 750~ish rows left for actual exploration

In [26]:
df_clean_mf_vals = df_clean_mf.dropna(subset=['VALUE']).copy()

In [27]:
df_clean_mf_vals.to_csv('cleaned_graduate_gender_ocupations.csv', index=False)